{
    "name": "MATH 2940 - Linear Algebra for Engineers",
    "crosslisted": [],
    "distributions": [
        "SMR-AS"
    ],
    "seasons_offered": [
        "Fall",
        "Spring",
        "Summer"
    ],
    "credits": 4,
    "grading": "Student option grading",
    "forbidden_overlaps": [
        "MATH 2940",
        "MATH 2210",
        "MATH 2230",
        "MATH 2310"
    ],
    "forbidden_overlaps_str": "Forbidden Overlap: due to an overlap in content, students will receive credit for only one course in the following group: MATH 2210 , MATH 2230 , MATH 2310 , MATH 2940.",
    "prerequisites": [
        "MATH 1920"
    ],
    "prerequisites_str": "Prerequisite: MATH 1920 .",
    "remaining_text": "Taking MATH 2930 and MATH 2940 simultaneously is not recommended. For guidance in selecting an appropriate course, please consult First Steps in Math . Staff. Linear algebra and its applications. Topics include: matrices, determinants, vector spaces, eigenvalues and eigenvectors, orthogonality and inner product spaces; applications include brief introductions to difference equations, Markov chains, and systems of linear ordinary differential equations. May include computer use in solving problems.",
    "raw": "MATH 2940 - Linear Algebra for Engineers\n(SMR-AS)\nFall, Spring, Summer.  4 credits. Student option grading.\nForbidden Overlap: due to an overlap in content, students will receive credit for only one course in the following group:\nMATH 2210\n,\nMATH 2230\n,\nMATH 2310\n, MATH 2940.\nPrerequisite:\nMATH 1920\n.   Taking\nMATH 2930\nand MATH 2940 simultaneously is not recommended. For guidance in selecting an appropriate course, please consult\nFirst Steps in Math\n.\nStaff.\nLinear algebra and its applications. Topics include: matrices, determinants, vector spaces, eigenvalues and eigenvectors, orthogonality and inner product spaces; applications include brief introductions to difference equations, Markov chains, and systems of linear ordinary differential equations. May include computer use in solving problems.",
    "all_prereqs": [
        "MATH 1910",
        "MATH 1920"
    ],
    "prereq_tree": {
        "MATH 1920": {
            "name": "MATH 1920 - Multivariable Calculus for Engineers",
            "crosslisted": [],
            "distributions": [
                "SMR-AS"
            ],
            "seasons_offered": [
                "Fall",
                "Spring",
                "Summer"
            ],
            "credits": 4,
            "grading": "Student option grading",
            "forbidden_overlaps": [
                "MATH 1920",
                "MATH 2240",
                "MATH 2220"
            ],
            "forbidden_overlaps_str": "Forbidden Overlap: due to an overlap in content, students will receive credit for only one course in the following group: MATH 1920, MATH 2220 , MATH 2240 .",
            "prerequisites": [
                "MATH 1910"
            ],
            "prerequisites_str": "Prerequisite: MATH 1910 or equivalent AP credit.",
            "remaining_text": "For guidance in selecting an appropriate course, please consult First Steps in Math . Staff. Introduction to multivariable calculus. Topics include partial derivatives, double and triple integrals, line and surface integrals, vector fields, Green’s theorem, Stokes’ theorem, and the divergence theorem.",
            "raw": "MATH 1920 - Multivariable Calculus for Engineers\n(SMR-AS)\nFall, Spring, Summer.  4 credits. Student option grading.\nForbidden Overlap: due to an overlap in content, students will receive credit for only one course in the following group: MATH 1920,\nMATH 2220\n,\nMATH 2240\n.\nPrerequisite:\nMATH 1910\nor equivalent AP credit.   For guidance in selecting an appropriate course, please consult\nFirst Steps in Math\n.\nStaff.\nIntroduction to multivariable calculus. Topics include partial derivatives, double and triple integrals, line and surface integrals, vector fields, Green’s theorem, Stokes’ theorem, and the divergence theorem.",
            "all_prereqs": [
                "MATH 1910"
            ],
            "prereq_tree": {
                "MATH 1910": {
                    "name": "MATH 1910 - Calculus for Engineers",
                    "crosslisted": [],
                    "distributions": [
                        "SMR-AS"
                    ],
                    "seasons_offered": [
                        "Fall",
                        "Spring",
                        "Summer"
                    ],
                    "credits": 4,
                    "grading": "Student option grading",
                    "forbidden_overlaps": [
                        "MATH 1120",
                        "MATH 1910"
                    ],
                    "forbidden_overlaps_str": "Forbidden Overlap: due to an overlap in content, students will not receive credit for both MATH 1120 and MATH 1910.",
                    "prerequisites": [],
                    "prerequisites_str": "Prerequisite: three years high school mathematics, including trigonometry and logarithms, and at least one course in differential and integral calculus, or equivalent AP credit.",
                    "remaining_text": "For guidance in selecting an appropriate course, please consult First Steps in Math . Staff. Essentially a second course in calculus. Topics include techniques of integration, finding areas and volumes by integration, exponential growth, partial fractions, infinite sequences and series, tests of convergence, and power series.",
                    "raw": "MATH 1910 - Calculus for Engineers\n(SMR-AS)\nFall, Spring, Summer.  4 credits. Student option grading.\nForbidden Overlap: due to an overlap in content, students will not receive credit for both\nMATH 1120\nand MATH 1910.\nPrerequisite: three years high school mathematics, including trigonometry and logarithms, and at least one course in differential and integral calculus, or equivalent AP credit. For guidance in selecting an appropriate course, please consult\nFirst Steps in Math\n.\nStaff.\nEssentially a second course in calculus. Topics include techniques of integration, finding areas and volumes by integration, exponential growth, partial fractions, infinite sequences and series, tests of convergence, and power series.",
                    "all_prereqs": [],
                    "prereq_tree": {}
                }
            }
        }
    }
}